"""
Написать программу для вычисления значения выражений.
Проверить правильность выполнения задания с помощью тестовых значений.

y1 = ((1+a+a^2)/(2a+a^2) + 2 - (1-a+a^2)/(2a-a^2))^-1 * (5-2a^2)

y2 = 1/4 * (sin(a+b-g) + sin(b+g-a) + sin(g+a-b) - sin(a+b+g))

--------------------
Тестовые значения:

a       y1
10      -48
50      -1248
100     -4998

a (grad)  b (grad)  g (grad)    rad         y2
0           0           0        0          0
30          30          30      0.471       0.125
60          60          60      0.942       0.650
90          90          90      1.414       1
"""

import math

a = 100
y1 = math.pow(((1+a+a**2)/(2*a+a**2) + 2 - (1-a+a**2)/(2*a-a**2)), -1)*(5-2*a**2)
print('y1=', y1)

a = math.radians(90)
b = math.radians(90)
g = math.radians(90)

y2 = 1/4 *(math.sin(a+b-g)+math.sin(b+g-a)+math.sin(g+a-b)-math.sin(a+b+g))
print('y2=', y2)

