"""
Создать пустую переменную. Проверить ее на истинность и ложность.
Объясните полученный результат.
"""
a = None
print('is True: ', a is True)
print('is False: ', a is False)
