'''
Тема 6: “Матрицы”
2. Дана квадратная матрица. Проверьте, является ли она диагональной.
---------------
Тестовые значения:
[[2,0,0,0,0],
 [0,3,0,0,0],
 [0,0,5,0,0],
 [0,0,0,5,0],
 [0,0,0,0,2]]
'''
m = [[2,0,0,0,0],
     [9,3,0,0,0],
     [0,0,5,0,0],
     [0,0,0,5,0],
     [0,0,0,0,2]]

is_diag = True

for i in range(0, len(m)):
    print(f"i = {i}")
    for j in range(0, len(m[i])):
        print(f"j = {j}")
        if i != j and m[i][j] != 0:     # 1 != 0 и 9 != 0 - True. 1 != 1 и 3 != 0 - False
            is_diag = False
            break

    if not is_diag:
        break

print(f"is_diag - {is_diag}")

