'''
Тема 6: “Матрицы”
2. Дана квадратная матрица. Проверьте, является ли она нижнетреугольной.
Если да, преобразуйте ее таким образом, чтобы она стала верхнетреугольной
---------------
Тестовые значения:
[[2,0,0,0,0],
 [1,3,0,0,0],
 [0,6,5,0,0],
 [2,7,9,5,0],
 [4,1,5,0,2]]
'''

m = [[2,0,0,0,0],
     [1,3,0,0,0],
     [0,6,5,0,0],
     [2,7,9,5,0],
     [4,1,5,0,2]]

is_ntr = True

for i in range(0, len(m)):
    for j in range(i + 1, len(m[i])):
        if m[i][j] != 0:
            is_ntr = False
            break
    if not is_ntr:
        break

print(is_ntr)

if is_ntr:
    # транспонирование матрицы
    for i in range(0, len(m)):
        for j in range(i+1, len(m[i])):
            m[i][j], m[j][i] = m[j][i], m[i][j]

    for row in m:
        print(row)
