# Выведите на экран все числа в интервале от 0 до 6
# включительно кроме чисел 3 и 5

"""""
i = 0

while i <= 7:
    for i != 3:
        print(i)
    for i != 6:
        print(i)
    # if i == 3:
    #     continue
    # elif i == 6:
    #     continue
    # else:
    #     print(i)
    i += 1c
"""
for i in range(0,7):
    if i != 3:
        if i != 5:
            print(i)


#TODO Короче не знаю как решить эту задачу(((