'''
Тема 2: “Циклы с условием”
3.	Дана последовательность вещественных чисел.
Определить среднее арифметическое среди кратных 7 элементов последовательности.

---------------
Тестовые значения:
[2.4, 6.2, 7.0, 14.0, 0.7, 12.4]    10.5
[2.3, 6.0, 7.0, 6.7, 21.0, 12.4, 77.0, 100.0, 16.9] 35
[14.0, 21.0, 700.0]     245
[2.4, 6.2, 7.7, 14.2, 0.7, 12.4]    no such numbers
'''

l = [2.3, 6.0, 7.0, 6.7, 21.0, 12.4, 77.0, 100.0, 16.9]
print(len(l))

i = 0   # index
nums = []

while i < len(l):
    print(i)
    if l[i] % 7 == 0:
        nums.append(l[i])
    i += 1

if nums:
    res = sum(nums) / len(nums)
    print(res)
else:
    print("Таких чисел не найдено")

