"""
Написать функцию, принимающую произвольное количество целых чисел
и возвращающую наибольшее положительное из них кратное 13.

------------------
Тестовые значения:
2, 7, 0, 3, 1, 5, -13 -> no nums
2, 7, 0, 3, 1, 5, -13, 13 -> 13
26 -> 26
99, 99, 100, 34, -39 -> no nums
99, 39, 99, 100, 34 -> 39
"""
def find_num(*args):
    max = -1
    for i in args:
        if i>0 and i%13==0 and i>max:
            max = i
    if max!=-1:
        return max
    return 'no such numbers'

print(find_num(2, 7, 0, 3, 1, 5, -13))
print(find_num(2, 7, 0, 3, 1, 5, -13, 13))
print(find_num(26))
print(find_num(99, 99, 100, 34, -39))
print(find_num(99, 39, 99, 100, 34))