import math

#TODO: Написать программу, а не просто решение приведенной задачи

x = 20
y = 21

BC = math.hypot(20, 21)

print(f"Расстояние между верхушками (Гипотенуза) равно - {int(BC)} м.")
