"""
Дано три словаря: {1: 10, 2: 20}, {3: 30, 4: 40} и {5: 50, 6: 60}.
Объединить данные словари в один.
"""

d1 = {1: 10, 2: 20}
d2 = {3: 30, 4: 40}
d3 = {5: 50, 6: 60}

d1.update(d2)
d1.update(d3)
print(d1)
