"""
Написать рекурсивную функцию для нахождения n-го числа Фибоначчи.

--------------
Тестовые значения:
1 1 2 3 5 8 13 21 34 55 89 ....

n = 3,  3
n = 6,  13
n = 10, 89
"""
def fib(n):
    if n in [0, 1]:
        return 1
    return fib(n-1)+fib(n-2)

print(fib(3))
print(fib(6))
print(fib(10))