"""
Написать рекурсивную функцию возведения числа в целую степень.

------------
Тестовые значения:
3^4 = 81
10^3 = 1000
5^5 = 3125
6^-2 = 0.03
"""

def pow(a, n):
    if n == 0:
        return 1
    if n < 0:
        return 1/pow(a, -n)
    return a*pow(a, n-1)

print(pow(3, 4))
print(pow(10, 3))
print(pow(5, 5))
print(pow(6, -2))
