'''
Тема 2: “Тип None. Логический тип данных”

2.	Создать пустую переменную. Проверить ее на истинность и ложность. Объясните полученный результат.
'''

a = None

print(type(a))
