'''
Тема 3: “Числовой тип данных”
1.	Написать программу для вычисления значения выражений. Проверить правильность
выполнения задания с помощью тестовых значений.
'''
from math import *

a = 1
b = 1
y = 1
y = ((1 + a + a**2) / (2*a + a**2) + 2 - (1 - a + a**2) / (2*a - a**2))**-1 * (5 - 2*a**2)

print(y)



y = 1 / 4 * (sin(a + b + y) + sin(b + y - a) + sin(y + a - b) - sin (a + b + y))

print(y)