"""
Даны несколько списков: [-8, 1, 2, -2, 0], [1, 1, 0, 0, 2, -2, -2],
[1, -1, 0, -9, 4, -5], [1, 4, 0, 23, 6, 34].
Для каждого из списков найти второе наименьшее значение в нем
(ответы: -2, 0, -5, 1)
"""

l1 = [-8, 1, 2, -2, 0]
l2 = [1, 1, 0, 0, 2, -2, -2]
l3 = [1, -1, 0, -9, 4, -5]
l4 = [1, 4, 0, 23, 6, 34]

s1 = sorted(set(l1))
s2 = sorted(set(l2))
s3 = sorted(set(l3))
s4 = sorted(set(l4))

print(s1[1], s2[1], s3[1], s4[1])

